---
kind: other
id: Methods.T:Autodesk.Revit.DB.FabricationRodInfo
source: html/a4730fcb-fec9-3c9a-36e2-9255e3c8dd0c.htm
---
# FabricationRodInfo Methods

Attaches the hanger rod to another bearer hanger.